package help

import (
	"net/http"
)

func HelpHandler(w http.ResponseWriter, r *http.Request) {
	str := `
	Доступные команды: 
	- add {заголовок задачи из одного слова} {текст задачи из одного или нескольких слов} по эндпоинту (POST tasks/Add)
	— эта команда позволяет добавлять новые задачи в список задач
	- list — эта команда позволяет получить полный список всех задач (GET tasks/list) 
	- del — эта команда позволяет удалить задачу по её заголовку (DELETE /tasks/айди удаляемой задачи)
	- done — эта команда позволяет отменить задачу как выполненную (PATCH /tasks/айди выполняемой задачи)
	`
	w.Write([]byte(str))
}
